// // Переменные
// var x = 1 //устаревшая.динамическая
// let y = 2 //новая.динамическая
// const z = 3//константа.неизменяемая
// let a // -Undefined

// x = x + y //3

// alert('x = '+x) //оповещение
// alert(' x = z - its '+ (x == z)) //оповещение (true - правда)
// alert('y = '+y) //оповещение
// alert(a)
//Типы данных

//Целочисленный - int (3,2,1,4,6,8,3463456467457845673467,243563567)
//Дробный - float (1.5, 2.235345657867, 15.523)
//Строковый тип данных - string (' ', " ", ` 619519519651651fsd1g6dt5h1f6j1g6hu5k16hjk15g`)
//Сравнительный тип данных (boolean) - bool (1 == 1 - true), (2<1 - false), (2!=1) - true, (1!=1) - false
//Undefined. null. - не определенный тип данных
//Object (Словари(объекты),(массивы),(функции),(классы))
// let i = 0
// let x = 0
// let y = 0

// while(i<=100){

//     x = x + i //2+4+6+8+10+12+14+16+18
//     i = i+2//0->2->4->6->8...102
//     console.log(x)
// }


// for(i=1;i<100;i+=2){

// y = y+i

// console.log(y)

// }


//Числа от 1 до 1000 - кратные 3. 3

// % - остаток от целочисленного деления
let i = 3
let x = 0
for(i;i<=1000;i+=3){
    
if(i%3 == 0){
    console.log(i)
    x=x+1
    
}

}
console.log(x)






